[{"id":7373,"date":"2019-05-07T12:56:12","date_gmt":"2019-05-07T12:56:12","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7373"},"modified":"2019-05-07T13:08:52","modified_gmt":"2019-05-07T13:08:52","slug":"olympians-asthma","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/olympians-asthma\/","title":{"rendered":"The Olympians who achieved success in the pool despite being asthmatic"},"content":{"rendered":"<p>Mention the names Rebecca Adlington, Jo Jackson, Adrian Moorehouse and Karen Pickering and one thing immediately springs to mind – swimming at the Olympic Games.<\/p>\n<p>And while all four swimmers did represent Team GB at various Olympics with a variety of success, they also have one other thing in common.<\/p>\n<p>They’ve all been diagnosed with asthma.<\/p>\n<p>Figures from Asthma UK show there are 5.4 million people living with the long-term condition in the UK and, on average, someone has a potentially life-threatening attack every 10 seconds.<\/p>\n<p>Yet being asthmatic shouldn’t deter people from exercise such as swimming, walking, an exercise class or even training for a marathon.<\/p>\n<p>Asthma UK advise that the condition doesn’t have to stop people from getting on with life and the evidence shows that exercise is good for people with asthma.<\/p>\n<p>Jackson, who won a bronze medal in the 400m Freestyle at the 2008 Beijing Olympics, backs up that claim.<\/p>\n<p>Although she has now retired from competitive swimming, she says taking part in sporting activity can help keep her asthma at a good level and under control.<\/p>\n<h2>Great support network<\/h2>\n<p>She said: “My asthma didn’t affect me learning to swim and it didn’t have an impact on my training or racing until I was a teenager.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“It became a more serious problem around 2010 after I had a few illnesses back-to-back. I started having asthma attacks during sets.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“I was really lucky because I had a great support network around me which really helped me through these tough times. I had to take some time out of the water and I started seeing an asthma specialist to look at how we could prevent the attacks.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“I was admitted to a hospital where I started new medication with a monthly follow-up appointment which definitely helped me to get back into full-time training. I took this medication for a year and once I’d finished the course, I was able to get back to my full training routine.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“It was a really tough few years as I missed a lot of training and competitions but I was really lucky that I had the support from everyone around me to help me continue with my sport.”<\/p>\n<p>Jackson said being honest with yourself and your coaches were key when it comes to coping with asthma while competing.<\/p>\n<p>“All of my coaches have been really accommodating with my asthma and have always listened to me,” she said.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“Whether you have asthma or not, I think it’s really important to have the kind of relationship with your coach where you can talk to them about issues and ask for advice.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<img class=\"alignnone size-full wp-image-7374\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson.jpg\" alt=\"Rebecca Adlington and Jo Jackson who both suffer from asthma but won Olympic medals\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/05\/adlington_and_jackson-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>\n<p>“I always made sure I had my inhaler in my bag so if I needed it during training I had it to hand and my coach would always let me get out of the pool if I needed to take it.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“I also found it beneficial to get back into training gently after an illness or when my asthma wasn’t great. I’d just take it easier for a few days and then gradually increase the volume and intensity until I was back to full fitness.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“As I got older, I definitely learnt to listen to my body and to be honest with my coach when things were getting on top of me. As an athlete, you always want to be on top of your game and pushing yourself to your limit but it’s about doing that in the right way.<\/p>\n<p>“I still exercise now, even though I’ve retired from competitive swimming, as I think it’s really important to keep fit and healthy. I feel like doing sport really benefits me and staying fit can actually keep my asthma at a good level and under control.”<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>These observations on the benefits of swimming are echoed in The Health and Wellbeing Benefits of Swimming report, an academic review commissioned by the independent Swimming and Health Commission.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Amongst other things, the report found that swimming can improve cardiovascular health, lung function and breathing techniques, particularly in children with asthma. The hydrostatic pressure against the chest wall was also thought to be beneficial.<\/p>\n<p>For some people with asthma, the humid pool environment made breathing easier although Kathy Mascarenhas, an asthma nurse specialist from Asthma UK, warned that some people identify chlorine as a trigger of their asthma.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Kathy added: “The single most important thing is for people to manage their asthma by taking their preventer inhaler with good technique, as prescribed, even when they feel well.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<h2>Asthma Action Plan<\/h2>\n<p>“Other advice I would give is to warm up and down for 10 to 15 minutes and have the blue reliever inhaler, and spacer if using one, easily accessible.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“So, when you&#8217;re swimming have it on the poolside. If any asthma symptoms start during the exercise stop, take the inhaler and rest, and don’t start again until you feel completely better.”<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>Kathy said a written Asthma Action Plan, which can be completed with a GP or asthma nurse, can help people to manage the condition by detailing when they should take their medication and help them to recognise what to do when they get symptoms.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>She added: “The completed plan can then be shared with swim teachers or coaches to help make them aware of an individual’s needs. This can be particularly reassuring for parents of children with asthma.”<\/p>\n<p>Elaine McNish, head of health and wellbeing at Swim England, said: “Asthma is one of a range of conditions that is being included in our work to make swimming an accessible activity for people with long-term health conditions.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“As part of this, we’re talking with experts to put together advice for teachers on how to support people with asthma, such as making sure a swimmer has their inhaler poolside and trying certain breathing techniques.<\/p>\n<p>“We’re building on what we have learned from our project with people with dementia to work with partners to make sure people with a wide range of chronic conditions can enjoy the health and wellbeing benefits of swimming.”<\/p>\n<ul>\n<li><em><strong>A version of this article first appeared in Swimming Times<\/strong><\/em><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Mention the names Rebecca Adlington, Jo Jackson, Adrian Moorehouse and Karen Pickering and one thing immediately springs to mind – swimming at the Olympic Games. And while all four swimmers did represent Team GB at various Olympics with a variety of success, they also have one other thing in common. They’ve all been diagnosed with &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/olympians-asthma\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":65,"featured_media":7375,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7373"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7373"}],"version-history":[{"count":3,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7373\/revisions"}],"predecessor-version":[{"id":7378,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7373\/revisions\/7378"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7375"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7373"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7373"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7373"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7365,"date":"2019-05-04T07:01:04","date_gmt":"2019-05-04T07:01:04","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7365"},"modified":"2019-05-04T07:39:34","modified_gmt":"2019-05-04T07:39:34","slug":"maisie-summers-newton-shortlisted-award","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/maisie-summers-newton-shortlisted-award\/","title":{"rendered":"Teenager Maisie Summers-Newton shortlisted for award"},"content":{"rendered":"<p>Teenager Maisie Summers-Newton has been shortlisted by the International Paralympic Committee for April’s Allianz Athlete of the Month award.<\/p>\n<p>The 16-year-old set a <a title=\"Maisie Summers-Newton sets new world record\" href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\" target=\"_blank\" rel=\"noopener\">new world record in the 200m Individual Medley<\/a> on her way to the World Para-swimming World Series gold in Glasgow.<\/p>\n<p>She shattered her own personal SM6 best after finishing in 2:57.99.<\/p>\n<p>And it was that performance that saw Summers-Newton be put forward for the award.<\/p>\n<p>The nominations are compiled from submissions by National Paralympic Committees (NPCs) and International Federations (IFs).<\/p>\n<p>Votes can be cast on the <a title=\"International Paralympic website\" href=\"https:\/\/www.paralympic.org\" target=\"_blank\" rel=\"noopener\">International Paralympic website<\/a> by Friday 10 May.<\/p>\n<p>After her record-breaking triumph in Glasgow, Summers-Newton said: “It means a lot.<\/p>\n<h2>Whirlwind few months<\/h2>\n<p>“I didn’t feel that confident coming in. I was just really nervous, but my main goal was to just qualify in the heats and do really well in the final. To do that, I’m really happy with it.”<\/p>\n<p>Summers-Newton is up against Australian triathlete Kate Doughty, Indian badminton player Krishna Nagar, Switzerland athlete Manuela Schae and Australian athlete Michael Roeger.<\/p>\n<p>It&#8217;s been a whirlwind few months for Summers-Newton.<\/p>\n<p>In August 2018, she made her senior international debut at the World Para-Swimming European Championships in Dublin in August and won four medals – three of them gold.<\/p>\n<p>And she was then shortlisted for the BBC Young Sports Personality of the Year Award.<\/p>\n<p>At the time, she said: &#8220;To be considered means so much to me. Having previously seen so many inspirational and successful athletes win this award it’s quite a surreal feeling to be shortlisted.<\/p>\n<p>“2018 has been such an amazing year for me and it was great to see all my hard work pay off and I can’t wait to see what next season brings!”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Teenager Maisie Summers-Newton has been shortlisted by the International Paralympic Committee for April’s Allianz Athlete of the Month award. The 16-year-old set a new world record in the 200m Individual Medley on her way to the World Para-swimming World Series gold in Glasgow. She shattered her own personal SM6 best after finishing in 2:57.99. And &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/maisie-summers-newton-shortlisted-award\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":65,"featured_media":5819,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7365"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7365"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7365\/revisions"}],"predecessor-version":[{"id":7370,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7365\/revisions\/7370"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/5819"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7365"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7365"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7365"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7353,"date":"2019-04-30T12:24:02","date_gmt":"2019-04-30T12:24:02","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7353"},"modified":"2019-04-30T12:24:02","modified_gmt":"2019-04-30T12:24:02","slug":"world-paraswimming-championships-squad","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/world-paraswimming-championships-squad\/","title":{"rendered":"Great Britain names strong squad for World Para-swimming Championships"},"content":{"rendered":"<p>Six Paralympic champions spearhead a strong Great Britain squad that will compete at the 2019 World Para-swimming Championships.<\/p>\n<p>Jessica Jane Applegate, Bethany Firth, Michael Jones, Eleanor Robinson, Eleanor Simmonds and Alice Tai are among the 24 British swimmers that will take part in the <a title=\"London Aquatics Centre to host World Para-swimming Championships\" href=\"https:\/\/www.swimming.org\/sport\/london-world-paraswimming-championships\/\" target=\"_blank\" rel=\"noopener\">prestigious event at the London Aquatics Centre<\/a> from 9-15 September.<\/p>\n<p>The remainder of the squad also features of wealth of experience with Paralympic, World and European medallists included, while there are also swimmers making their senior international debut.<\/p>\n<p>A number of swimmers booked their places in the team following the British Para-swimming International Meet at the Tollcross International Sports Centre in Glasgow.<\/p>\n<p>The event saw a number of world records shattered with Tai, Maisie Summers Newton, Reece Dunn and Ellie Challis all setting new bests.<\/p>\n<p>Rob Aubry, head coach of the squad, said he was excited about the prospect of what the team could achieve.<\/p>\n<h2>Challenge for medals<\/h2>\n<p>He added: “I’m delighted with the team that we have selected to represent Great Britain at the World Championships in London in September.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“We have selected a team that will not just make finals, but challenge for medals in front of a home crowd.<\/p>\n<p>“With a year to go until Tokyo, we have also selected a couple of new faces onto the team, to gain valuable experience within the final preparation phase.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>&#8220;These athletes will be working hard on race preparation and learning what it takes to deliver their best performances under pressure.<\/p>\n<p>“We have always delivered strong performances in the female relays but I’m delighted that we’ve been able to select a strong S14 Mixed Relay combination too.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>&#8220;I’m excited about the prospect of this team and future development of these individuals, as we continue to push these combinations forwards at a global level.”<\/p>\n<div class=\"highlightbox\">\n<h3>The British Para-Swimming team for the 2019 World Para Swimming Championships:<\/h3>\n<p>The athletes below gained selection after they achieved the consideration time as per the selection policy (individual):<\/p>\n<ul>\n<li>Jessica Jane Applegate, England, City of Norwich SC<\/li>\n<li>Jordan Catchpole, England, City of Norwich SC<\/li>\n<li>Stephen Clegg, Scotland, City of Sunderland ASC<\/li>\n<li>Reece Dunn, England, Plymouth Leander SC<\/li>\n<li>Louise Fiddes, England, Hatfield SC<\/li>\n<li>Bethany Firth, England, Newcastle Swim Team<\/li>\n<li>Thomas Hamer, England, Stockport Metro SC<\/li>\n<li>Michael Jones, England, National Performance Centre\/COMAST<\/li>\n<li>Scott Quin, Scotland, Warrender Baths<\/li>\n<li>Rebecca Redfern, England, Worcester SC<\/li>\n<li>Megan Richter, England, Orion SC<\/li>\n<li>Eleanor Robinson, England, Northampton SC<\/li>\n<li>Toni Shaw, Scotland, University of Aberdeen<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Eleanor Simmonds, England, Camden Swiss Cottage SC<\/li>\n<li>Maisie Summers Newton, England, Northampton SC<\/li>\n<li>Alice Tai, England, Ealing SC<\/li>\n<li>Brock Whiston, England, Barking &amp; Dagenham Aquatics Club<\/li>\n<\/ul>\n<p>The athletes below gained selection after they achieved the consideration time as per the selection policy (relay):<\/p>\n<ul>\n<li>Stephanie Millward, England, Corsham ASC<\/li>\n<li>Zara Mullooly, England, Guildford City SC<\/li>\n<\/ul>\n<p>The athletes below gained selection at the discretion of the National Performance Director:<\/p>\n<ul>\n<li>Ellie Challis, England, Colchester Phoenix ASC<\/li>\n<li>Suzanna Hext, England, Swindon Dolphin ASC   <span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Tully Kearney, England, National Performance Centre\/COMAST<\/li>\n<li>Louis Lawlor, Scotland, Glasgow SC<\/li>\n<li>Rhys Davies, Wales, Pembroke &amp; District ASC<\/li>\n<\/ul>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Six Paralympic champions spearhead a strong Great Britain squad that will compete at the 2019 World Para-swimming Championships. Jessica Jane Applegate, Bethany Firth, Michael Jones, Eleanor Robinson, Eleanor Simmonds and Alice Tai are among the 24 British swimmers that will take part in the prestigious event at the London Aquatics Centre from 9-15 September. The &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/world-paraswimming-championships-squad\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":65,"featured_media":7354,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7353"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7353"}],"version-history":[{"count":6,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7353\/revisions"}],"predecessor-version":[{"id":7360,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7353\/revisions\/7360"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7354"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7353"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7353"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7353"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7347,"date":"2019-04-29T13:58:03","date_gmt":"2019-04-29T13:58:03","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7347"},"modified":"2019-04-29T13:58:03","modified_gmt":"2019-04-29T13:58:03","slug":"world-university-games-2019-squad","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/world-university-games-2019-squad\/","title":{"rendered":"Commonwealth gold medallist Sarah Vasey selected for World University Games squad"},"content":{"rendered":"<p>Commonwealth Games gold medallist Sarah Vasey is among a strong squad of 14 swimmers that will represent Great Britain&#8217;s students at this summer’s 2019 World University Games.<\/p>\n<p>Loughborough University’s Vasey is joined by Abbie Wood, David Cumberlidge, Chloe Golding and Jocelyn Ulyett, who also represented Team England at the 2018 Commonwealth Games on Australia’s Gold Coast.<\/p>\n<p>Vasey won the 50m Breastroke at the 2018 Commonwealth Games and has also represented Great Britain at the 2017 World Championships in Budapest and the European Championships in Glasgow last year.<\/p>\n<p>In total, 11 swimmers who represented their home nations at the 2018 Commonwealth Games have been included in the squad for the 30th edition of the Summer Universade in Naples, Italy, between 3-14 July.<\/p>\n<p>Team leader Adam Clarke said the squad heading for Italy was packed with experience.<\/p>\n<p>He added: “The World University Games is the second largest multi-sport event after the Olympics, and a great opportunity for British swimmers to compete on the world stage. <span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“The team we have nominated to represent British University and College Sport is packed with a wealth of experience, with 11 of the team in action for their home nations at last year’s Commonwealth Games, and four athletes making their second Summer Universiade appearance.<\/p>\n<h2>Exciting programme of swimming<\/h2>\n<p>“We also have two athletes, Emily Barclay and Alicia Wilson, making their debuts at this level and the Games will provide a great opportunity for them to accelerate their development and continue their journey towards future senior success on the world stage.<\/p>\n<p>“It is always a great experience to work with the BUCS team and I’m very much looking forward to an exciting programme of swimming in Naples in July.”<\/p>\n<p>Ross Simpson, BUCS Deputy Chef de Mission, added: “It is fantastic to see such a high calibre of athlete selected by British Swimming for the World University Games this summer in Naples.<\/p>\n<p>“GB students will have a delegation of around 135 athletes and staff and I am sure Adam and his squad will provide a lot of experience to the overall success of the team.<\/p>\n<p>“I hope the swimming venue, Piscina Scandone, will be the scene of plenty great results, PB’s and a brilliant experience for those involved.<span class=\"Apple-converted-space\"> <\/span><\/p>\n<p>“Well done to all of those selected. As always it highlights the strength of swimming within universities.”<\/p>\n<p>Also included in the squad are two-time Olympian Craig Benson and European Championship 4x100m Medley Relay gold medallist Charlotte Atkinson.<\/p>\n<div class=\"highlightbox\">\n<h3>GB Squad selected for the 2019 World University Games<\/h3>\n<ul>\n<li>Charlotte Atkinson, Isle of Man, Loughborough University<\/li>\n<li>Emily Barclay, England, Loughborough University<\/li>\n<li>Craig Benson, Scotland, University of Stirling<\/li>\n<li>David Cumberlidge, England, Edinburgh University<\/li>\n<li>Chloe Golding, England, Manchester Metropolitan<\/li>\n<li>Kathryn Greenslade, Wales, Edinburgh University<\/li>\n<li>Joe Litchfield, England, Sheffield Hallam<\/li>\n<li>Katie Matts, England, Manchester Metropolitan<\/li>\n<li>Craig McLean, Scotland, University of Stirling<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Mark Szaranek, Scotland, University of Florida<\/li>\n<li>Jocelyn Ulyett, England, Loughborough University<\/li>\n<li>Sarah Vasey, England, Loughborough University<\/li>\n<li>Alicia Wilson, England, University of California, Berkley<span class=\"Apple-converted-space\"> <\/span><\/li>\n<li>Abbie Wood, England, Loughborough University<\/li>\n<\/ul>\n<p>* As a British Universities and College Sport representative team, selections are subject to confirmation of academic eligibility.<\/p>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>Commonwealth Games gold medallist Sarah Vasey is among a strong squad of 14 swimmers that will represent Great Britain&#8217;s students at this summer’s 2019 World University Games. Loughborough University’s Vasey is joined by Abbie Wood, David Cumberlidge, Chloe Golding and Jocelyn Ulyett, who also represented Team England at the 2018 Commonwealth Games on Australia’s Gold &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/world-university-games-2019-squad\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":65,"featured_media":7351,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7347"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/65"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7347"}],"version-history":[{"count":4,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7347\/revisions"}],"predecessor-version":[{"id":7352,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7347\/revisions\/7352"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7351"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7347"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7347"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7347"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7341,"date":"2019-04-28T20:30:39","date_gmt":"2019-04-28T20:30:39","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7341"},"modified":"2019-04-28T20:30:39","modified_gmt":"2019-04-28T20:30:39","slug":"alice-tai-three-world-records-two-days-glasgow","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/alice-tai-three-world-records-two-days-glasgow\/","title":{"rendered":"Alice Tai breaks three world records in two days in Glasgow"},"content":{"rendered":"<p>Alice Tai breaks yet another world record as she claims the women’s Multi-Class (MC) 50m Freestyle World Series gold.<\/p>\n<p>The Ealing swimmer topped off a <a title=\"World Series success continues for Britain\" href=\"https:\/\/www.swimming.org\/sport\/world-series-success-continues-britain\/\" target=\"_blank\" rel=\"noopener\">successful few days<\/a> at the British Para-Swimming International Meet in Glasgow by setting yet another world record.<\/p>\n<p>Tai’s time of 29.43 was a personal best and a new world record in the S8 category for the women’s MC 50m Freestyle. Her time racked up an impressive total score of 1030 points.<\/p>\n<p>Second and third places were fought out between Carlotta Gilli of Italy and Aurelie Rivard of Canada, with the Italian finishing ahead by 12 points with her total of 926 points, to take the silver medal.<\/p>\n<p>Tai was extremely close to breaking her second world record of the night in the women’s MC 100m Butterfly, finishing just 0.05 outside of her close friend Stephanie Slater’s current record (1:08.20) with a time of 1:08.25.<\/p>\n<p>The 20-year-old said: “Steph’s an absolute legend and I love her to bits. I was like if I go 0.01 outside it [the world record] that’s ideal.<\/p>\n<p>“But then I also screwed up my turn really badly, so I feel like that would’ve been under the world record if I hadn’t, but I’m kind of happy it still stands because I don’t want to take it from her.”<\/p>\n<p>It was two more World Series gold’s for Tai to add to her collection, but her new world record made it three records within two days.<\/p>\n<p>After <a title=\"Tai and Challis break world records in Glasgow\" href=\"https:\/\/www.swimming.org\/sport\/tai-challis-world-records-glasgow\/?utm_campaign=CompetitiveSwimming&amp;utm_medium=TaiChallisWorldRecords&amp;utm_source=NewsBlade&amp;fbclid=IwAR2mat-Vywi-GdxQHguojOIptGnEVr1dLJm1q6nrRfgTASdR5mvCtm2fp80\" target=\"_blank\" rel=\"noopener\">breaking the women’s 100m Backstroke world record during day three<\/a>, she then broke the 50m Freestyle record in the heats with a time of 29.66 and again in the final (29.43).<\/p>\n<img class=\"alignnone size-full wp-image-7344\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web.jpg\" alt=\"Alice Tai wins World Series gold medal\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-Gold-Day-4-web-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>\n<h3><strong>Gold, silver and bronze for Britain<\/strong><\/h3>\n<p>With Alice Tai clocking a time of 1:08.25 in the 100m Butterfly, her total points tally of 997, placed her ahead of fellow British swimers Jessica-Jane Applegate and Toni Shaw.<\/p>\n<p>Applegate is the current world record holder for the women’s S14 category 100m Butterfly, but couldn’t better that this time around as she took the silver medal in a time of 1:05.12, which scored her 955 points.<\/p>\n<p>Scottish swimmer Toni Shaw swam a time of 1:08.52 to finish in the bronze medal position and earn 924 points.<\/p>\n<h3><strong>Challis continues to impress<\/strong><\/h3>\n<p>Young Ellie Challis was also a record breaker in the final day of the British Para-Swimming International Meet, smashing the current S3 British record in the women’s 50m Backstroke (1:04.36) with a time of 1:01.53.<\/p>\n<p>The Colchester Phoenix swimmer was beaten to the gold medal by Italy’s Monica Boggioni, but Challis took silver as well as earning medals for being the top British and top junior British performer.<\/p>\n<h3><strong>Dunn gets the job done<\/strong><\/h3>\n<p>Reece Dunn of Plymouth Leander, who <a title=\"Records tumble as Brits win World Series gold in Glasgow\" href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\" target=\"_blank\" rel=\"noopener\">set a new S14 world record in the men’s multi-class (MC) 100m Freestyle<\/a> on the opening day in Glasgow, took another gold medal in the men’s MC 100m Butterfly with a time of 55.87 and a total score of 991 points.<\/p>\n<p>When asked what it would mean to be selected for the World Championships in London this September, Dunn said: “I’m feeling really happy with how I swam this week and finished it off with a nice race.<\/p>\n<p>“It would mean the world to me, I’ve worked my whole life for this, I’ve been competitive swimming since I was nine.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Alice Tai breaks yet another world record as she claims the women’s Multi-Class (MC) 50m Freestyle World Series gold. The Ealing swimmer topped off a successful few days at the British Para-Swimming International Meet in Glasgow by setting yet another world record. Tai’s time of 29.43 was a personal best and a new world record &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/alice-tai-three-world-records-two-days-glasgow\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":7343,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7341"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7341"}],"version-history":[{"count":2,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7341\/revisions"}],"predecessor-version":[{"id":7345,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7341\/revisions\/7345"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7343"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7341"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7341"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7341"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7337,"date":"2019-04-27T20:52:09","date_gmt":"2019-04-27T20:52:09","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7337"},"modified":"2019-04-27T20:52:09","modified_gmt":"2019-04-27T20:52:09","slug":"tai-challis-world-records-glasgow","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/tai-challis-world-records-glasgow\/","title":{"rendered":"Tai and Challis break world records in Glasgow"},"content":{"rendered":"<p>Alice Tai and Ellie Challis both broke world records on the penultimate day of the British Para-Swimming International Meet in Glasgow.<\/p>\n<p>With the event also acting as part of the World Para Swimming World Series and the British trials for the World Championships in London later this year, there was success on many levels for the home athletes.<\/p>\n<p>Ealing swimmer Tai won World Series gold earlier in the week, <a title=\"Day one results\" href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\" target=\"_blank\" rel=\"noopener\">winning the women’s Multi-Class (MC) 100m Freestyle.<\/a><\/p>\n<p>She continued her dominance in Glasgow on Saturday, claiming the silver medal in the women’s 100m Backstroke.<\/p>\n<p>Her time of 1:08.08 – which yielded 1007 points – was enough to break the S8 world record.<\/p>\n<p>Tai <a title=\"British Swimming report\" href=\"https:\/\/www.britishswimming.org\/news\/para-swimming-news\/challis-tai-and-quin-break-world-records-tollcross\/\" target=\"_blank\" rel=\"noopener\">said<\/a>: “I’m really pleased with the swim. It’s the fastest I’ve gone since 2017, so it’s showing that I’m going in the right direction.<\/p>\n<p>“Going into the race, I thought it would take a world record to win, but the top three all got them, so it was a great final.”<br \/>\n<img class=\"alignnone size-full wp-image-7339\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web.jpg\" alt=\"\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-Saturday-web-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><\/p>\n<h2>Challis continues spectacular rise<\/h2>\n<p>Ellie Challis has been one of the star performers this week in Glasgow.<\/p>\n<p>The Colchester Phoenix swimmer smashed a longstanding British record in the women’s MC 150m Individual Medley <a title=\"Day one results\" href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\" target=\"_blank\" rel=\"noopener\">on the opening day<\/a>, before setting a European and British record in the women’s MC 50m Butterfly a day later.<\/p>\n<p>She made yet another trip to the podium on Saturday, this time winning World Series gold in world record time.<\/p>\n<p>Challis touched the wall in 1:05.42 for a total of 1047 points, sneaking under the previous world best in the SB2 class.<\/p>\n<p>The teenager edged American Leanne Smith (SB3), who had pipped her to gold in the MC 150m Individual Medley.<\/p>\n<p>Challis said: “That was really good! I was always hoping to get the record, but I wasn’t sure if it was going to happen. It feels amazing.<\/p>\n<p>“I was hoping to follow Leanne and try and keep up for as far as I could, so I’m very pleased with how it went.<\/p>\n<p>“I’ll now focus on the other strokes a little bit more, as breaststroke has always been my favourite, but my other strokes are coming along really well.”<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Alice Tai and Ellie Challis both broke world records on the penultimate day of the British Para-Swimming International Meet in Glasgow. With the event also acting as part of the World Para Swimming World Series and the British trials for the World Championships in London later this year, there was success on many levels for &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/tai-challis-world-records-glasgow\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":78,"featured_media":7338,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7337"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/78"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7337"}],"version-history":[{"count":1,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7337\/revisions"}],"predecessor-version":[{"id":7340,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7337\/revisions\/7340"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7338"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7337"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7337"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7337"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7327,"date":"2019-04-26T21:45:46","date_gmt":"2019-04-26T21:45:46","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7327"},"modified":"2019-04-27T07:15:57","modified_gmt":"2019-04-27T07:15:57","slug":"world-series-success-continues-britain","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/world-series-success-continues-britain\/","title":{"rendered":"World Series success continues for Britain"},"content":{"rendered":"<p>Jessica-Jane Applegate and Louise Fiddes claimed World Para Swimming World Series gold and silver in the women’s multi-class (MC) 200m Freestyle, with a third of a second between them on day two of the British Para-Swimming International Meet in Glasgow.<\/p>\n<p>The City of Norwich swimmer took the World Series title and national honours with a time of 2:07.35 and a total score of 881 points after a close battle to the finish between her and fellow Brit, Louise Fiddes (2:07.68), who finished just seven points behind.<\/p>\n<p>However, both swimmers were under the consideration time as they hope to be selected for the British team at September’s World Championships in London.<\/p>\n<p>Applegate said: “I’m really happy with that, we actually went back and researched my times at Europeans and that’s even faster than what I swam then, so it’s really good to be getting back on track.”<\/p>\n<p>As well as taking the gold and silver medals, the women’s MC 200m Freestyle finals saw yet another British record broken as Ellie Challis beat the previous record (4:25.48) for her S3 category with a time of 4:24.97.<\/p>\n<p>The youngster has now broken three records so far this week after <a title=\"Records tumble as Brits win World Series gold in Glasgow\" href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\" target=\"_blank\" rel=\"noopener\">smashing the national 150m Individual Medley record by more than 20 seconds on the opening night<\/a>, setting a new European and British record in the women&#8217;s S3 50m Butterfly heats and now adding the S3 200m Freestyle to that list.<\/p>\n<h3><strong>Shocked Simmonds<\/strong><\/h3>\n<p>Eight-time Paralympic champion Ellie Simmonds was also back to winning ways as she took gold in the women’s MC 400m Freestyle World Series final.<\/p>\n<p>The 24-year-old was inside the qualification standard for the World Championships with a time of 5:19.27, just half a second outside of her own British record, earning her an impressive total of 957 points.<\/p>\n<p>Simmonds said: “I’m so shocked, I don’t know what to do I’m just so happy. I wasn’t expecting to swim 5:19, so close to my personal best, my main aim going into that was to hit the qualification time (5:22.98) and to go 5:19 I’m just over the moon I can’t believe it.”<\/p>\n<blockquote><p>“It’s swimming, I just love it and I’m so excited to hopefully get picked for the World Championships and it’s in London which is the pool I train in all the time, so I’m just over the moon.”<\/p><\/blockquote>\n<p>The Camden Swiss Cottage swimmer competed in her first World Championships back in 2006 at just 12-years-old.<\/p>\n<p><strong>Manchester men take gold and bronze<\/strong><\/p>\n<p>City of Manchester’s Mikey Jones and Lewis White both finished on the podium in the men’s MC 400m Freestyle final.<\/p>\n<p>Jones is the current <a title=\"Mikey Jones wins Paralympic gold\" href=\"https:\/\/www.swimming.org\/sport\/jones-gold-400m-free-paralympicsgb\/\" target=\"_blank\" rel=\"noopener\">Paralympic champion after winning gold in Rio<\/a> and he didn’t settle for anything less again as he earned the World Series title, clocking a time of 4:50.56 and finishing with 886 points.<\/p>\n<p>He said: “I&#8217;m very very happy with this morning. Tonight I just made a few mistakes in the final, I went out a little bit too fast but it’s a learning curve and we’ll move forward with that.”<\/p>\n<p>Bas Takken of the Netherlands was the only man preventing a clean sweep for Britain as he took silver, with Lewis White behind him in the bronze medal position and Oliver Hynd finishing fourth.<\/p>\n<img class=\"alignnone size-full wp-image-7331\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web.jpg\" alt=\"Mikey Jones takes gold\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-768x433.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-1024x577.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Michael-Jones-and-Kieran-Williams-Para-swimming-web-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/>\n<h3><strong>Robinson ‘really happy’<\/strong><\/h3>\n<p>Ellie Robinson took the first gold of the second night in Glasgow and finished under the World Championships consideration time.<\/p>\n<p>The Northampton swimmer won the women’s MC 50m Butterfly World Series title with a time of 36.20 and a total of 920 points.<\/p>\n<p>Robinson said: “I’m really happy to swim the qualifying time for Worlds. It’s quite reassuring to know that I’m ticking along and that I’m still where I need to be.”<\/p>\n<h3><strong>Catchpole cruises to victory<\/strong><\/h3>\n<p>Jordan Catchpole took the final gold medal to round off a successful night for Britain as he cruised home in the men’s MC 200m final.<\/p>\n<p>The City of Norwich swimmer was just outside the consideration time, reaching the wall in 1:58.12 and racking up a huge total of 940 points.<\/p>\n<p>Two Japanese swimmers, Takayuki Suzuki and Keichi Nakajima, finished in second and third, with Britain’s Dylan Broom not far behind in fourth.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Jessica-Jane Applegate and Louise Fiddes claimed World Para Swimming World Series gold and silver in the women’s multi-class (MC) 200m Freestyle, with a third of a second between them on day two of the British Para-Swimming International Meet in Glasgow. The City of Norwich swimmer took the World Series title and national honours with a time &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/world-series-success-continues-britain\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":77,"featured_media":7328,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7327"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/77"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7327"}],"version-history":[{"count":5,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7327\/revisions"}],"predecessor-version":[{"id":7335,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7327\/revisions\/7335"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7328"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7327"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7327"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7327"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7323,"date":"2019-04-26T15:54:29","date_gmt":"2019-04-26T15:54:29","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7323"},"modified":"2019-04-26T15:54:29","modified_gmt":"2019-04-26T15:54:29","slug":"gb-team-world-european-juniors","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/gb-team-world-european-juniors\/","title":{"rendered":"British squads named for World and European Junior Championships"},"content":{"rendered":"<p>25 junior swimmers from across England have been rewarded for their strong performances at the British Swimming Championships, earning a place at this summer’s major junior championships.<\/p>\n<p>22 English athletes will be part of the Great Britain team at the 2019 European Junior Championships in Kazan, Russia, from 3-7 July.<\/p>\n<p>Five of those swimmers – Charlie Brown, Pia Murray, Kayla Van Der Merwe, Michaella Glenister and Honey Osrin – will double up to feature at the World Junior Championships in Budapest, Hungary from 20-25 August.<\/p>\n<p>They’ll be joined on the British team by City of Leicester’s Will Bell &#8211; a member of the <a title=\"Swim England Performance Squad\" href=\"https:\/\/www.swimming.org\/sport\/performance-squad\/\" target=\"_blank\" rel=\"noopener\">Swim England Performance Squad<\/a> &#8211; City of Birmingham’s Charlotte Rigg and Millfield’s Rachel Anderson.<\/p>\n<h2>Taking on the world<\/h2>\n<p>An elite squad of 10 swimmers will represent Great Britain in Budapest, with last week’s performances in Glasgow offering plenty of promise for the team.<\/p>\n<p>Will Bell won silver in both the men’s 800m and 1500m Freestyle events at the British Championships, beating former European junior champion Tom Derbyshire in both events.<\/p>\n<p>It’s also been a successful start to the year for members of the Swim England Talent programme.<\/p>\n<p>World Championship-bound swimmers Van Der Merwe, Osrin, Rigg and Anderson all raced against some of Europe’s best <a title=\"Meeting de Nice\" href=\"https:\/\/www.swimming.org\/sport\/golden-tour-nice\/\" target=\"_blank\" rel=\"noopener\">at the Meeting de Nice in February.<\/a><\/p>\n<p>British Swimming’s Head of Elite Development, <a title=\"British Swimming team announcement\" href=\"https:\/\/www.britishswimming.org\/news\/latest-swimming-news\/british-swimming-unveils-european-and-world-junior-teams\/\" target=\"_blank\" rel=\"noopener\">Tim Jones, said<\/a>: “In amongst the results from the British Championships were some outstanding junior performances and prodigious talent, the likes of which we have not seen for a number of years.<\/p>\n<blockquote><p>“This is an exciting group of young swimmers, with a good number who will still be available for junior competition for another year or two.”<\/p><\/blockquote>\n<h2>Russia awaits<\/h2>\n<p>The 2018 European Junior Championships proved successful for Great Britain, with Tom Dean and the women’s 4x100m Medley relay team both setting championship records.<\/p>\n<p>The 2019 squad features exciting Derby youngster Jacob Whittle, of Derventio Excel Swim Squad, who last week swam the fastest ever 100m Freestyle time by a 14-year-old.<\/p>\n<p>Meanwhile, Nova Centurion’s Freya Colbert earned her place on the squad for the Europeans after finishing sixth in the Open 400m Freestyle final at the nationals.<\/p>\n<p>Northampton Swimming Club’s Edward Mildred, who set a new British junior record at the <a title=\"Mildred breaks record\" href=\"https:\/\/www.swimming.org\/sport\/new-british-record\/\" target=\"_blank\" rel=\"noopener\">Swim England National Winter Championships, <\/a>confirmed his place on the GB team by winning the junior 200m Freestyle final in Glasgow.<\/p>\n<div class=\"highlightbox\">\n<h3>British Swimming team for 2019 European Junior Championships<\/h3>\n<ul>\n<li><strong>Edward Mildred<\/strong> (England) Northampton Swimming Club<\/li>\n<li><strong>Oliver Taverner<\/strong> (England) Mount Kelly Swimming<\/li>\n<li><strong>Jacob Whittle<\/strong> (England) Derventio Excel Swim Squad<\/li>\n<li><strong>Samuel Osborne<\/strong> (England) City of Birmingham SC<\/li>\n<li><strong>Harry Noble<\/strong> (England) Mount Kelly Swimming<\/li>\n<li><strong>Adam Metcalf<\/strong> (England) Ellesmere College Titans SC<\/li>\n<li><strong>Joel Thompson<\/strong> (England) Ellesmere College Titans SC<\/li>\n<li><strong>Jacob Davies<\/strong> (England) City of Birmingham SC<\/li>\n<li><strong>Matthew Richards<\/strong> (Wales) The Royal Wolverhampton School<\/li>\n<li><strong>Charlie Hutchison<\/strong> (Scotland) Ellesmere College Titans SC<\/li>\n<li><strong>Charlie Brown<\/strong> (England) City of Sheffield Swim Squad<\/li>\n<li><strong>Archie Goodburn<\/strong> (Scotland) Warrender Baths Club<\/li>\n<li><strong>Kyle Booth<\/strong> (Wales) City of Cardiff<\/li>\n<li><strong>Katie Shanahan<\/strong> (Scotland) City Of Glasgow Swim Team<\/li>\n<li><strong>Freya Colbert<\/strong> (England) Nova Centurion SC<\/li>\n<li><strong>Tamryn Van Selm<\/strong> (England) Bromley SC<\/li>\n<li><strong>Mia Slevin<\/strong> (England) Derventio Excel Swim Squad<\/li>\n<li><strong>Lauren Wetherell<\/strong> (Scotland) Ellesmere College Titans SC<\/li>\n<li><strong>Emma Russell<\/strong> (Scotland) Heart of Midlothian ASC<\/li>\n<li><strong>Medi Harris<\/strong> (Wales) Swim Gwynedd<\/li>\n<li><strong>Sophie Freeman<\/strong> (England) Plymouth Leander SC<\/li>\n<li><strong>Maisie Elliott<\/strong> (England) City of Leicester SC<\/li>\n<li><strong>Sophie Yendell<\/strong> (England) City of Derby Swimming Club<\/li>\n<li><strong>Evelyn Davis<\/strong> (England) Bromley SC<\/li>\n<li><strong>Rebecca Clynes<\/strong> (England) City of Leeds SC<\/li>\n<li><strong>Fleur Lewis<\/strong> (England) Barnet Copthall SC<\/li>\n<li><strong>Pia Murray<\/strong> (England) Ellesmere College Titans SC<\/li>\n<li><strong>Kayla Van Der Merwe<\/strong> (England) Winchester City Penguins<\/li>\n<li><strong>Michaella Glenister<\/strong> (England) Leicester Sharks Swimming Club<\/li>\n<li><strong>Honey Osrin<\/strong> (England) Plymouth Leander SC<\/li>\n<\/ul>\n<\/div>\n<div class=\"highlightbox\">\n<h3>British Swimming team for 2019 World Junior Championships<\/h3>\n<ul>\n<li><strong>Will Bell<\/strong> (England) City of Leicester SC<\/li>\n<li><strong>Charlie Brown<\/strong> (England) City of Sheffield Swim Squad<\/li>\n<li><strong>Archie Goodburn<\/strong> (Scotland) Warrender Baths Club<\/li>\n<li><strong>Kyle Booth<\/strong> (Wales) City of Cardiff<\/li>\n<li><strong>Pia Murray<\/strong> (England) Ellesmere College Titans SC<\/li>\n<li><strong>Kayla Van Der Merwe<\/strong> (England) Winchester City Penguins<\/li>\n<li><strong>Charlotte Rigg<\/strong> (England) City of Birmingham SC<\/li>\n<li><strong>Michaella Glenister<\/strong> (England) Leicester Sharks Swimming Club<\/li>\n<li><strong>Rachel Anderson<\/strong> (England) Millfield School<\/li>\n<li><strong>Honey Osrin<\/strong> (England) Plymouth Leander SC<\/li>\n<\/ul>\n<\/div>\n","protected":false},"excerpt":{"rendered":"<p>25 junior swimmers from across England have been rewarded for their strong performances at the British Swimming Championships, earning a place at this summer’s major junior championships. 22 English athletes will be part of the Great Britain team at the 2019 European Junior Championships in Kazan, Russia, from 3-7 July. Five of those swimmers – &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/gb-team-world-european-juniors\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":78,"featured_media":7324,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7323"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/78"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7323"}],"version-history":[{"count":1,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7323\/revisions"}],"predecessor-version":[{"id":7325,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7323\/revisions\/7325"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7324"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7323"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7323"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7323"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7315,"date":"2019-04-25T19:36:54","date_gmt":"2019-04-25T19:36:54","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7315"},"modified":"2019-04-25T19:49:50","modified_gmt":"2019-04-25T19:49:50","slug":"brits-world-series-gold-glasgow","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/","title":{"rendered":"Records tumble as Brits win World Series gold in Glasgow"},"content":{"rendered":"<p>Maisie Summers-Newton set a new world record to win World Series gold in the 200m Individual Medley on the opening night of the British Para-Swimming International Meet in Glasgow.<\/p>\n<p>The Northampton swimmer broke her own previous SM6 world best, clocking 2:57.99 for a total of 1027 points, with the time subject to ratification.<\/p>\n<p>With this week’s national meet having the added incentive of being the seventh leg of the World Para Swimming World Series and acting as trials for the British team ahead of September’s World Championships, Summers-Newton has certainly made an immediate impression.<\/p>\n<p>The 16-year-old, who is already a four-time European champion, had comfortably achieved the qualifying standard for the worlds in her heat, but laid down another benchmark in the multi-class (MC) final.<\/p>\n<p>It could be the first of many trips to the podium this week for Summers-Newton, who will also compete in the 100m Freestyle, 400m Freestyle, 100m Backstroke, 100m Breaststroke and 50m Freestyle.<\/p>\n<p>“I didn’t feel that confident coming in,” she said. “I was just really nervous, but my main goal was to just qualify in the heats and do really well in the final. To do that, I’m really happy with it.<\/p>\n<blockquote><p>“My whole club have just been really supportive, so it’s just working really hard with them and hopefully I get the gold at the end.”<\/p><\/blockquote>\n<p>There was more joy for Britain in the same race, with another SM6 competitor, Camden Swiss Cottage swimmer Ellie Simmonds, grabbing bronze.<\/p>\n<p>The eight-time Paralympic champion just missed out on the consideration time for the World Championships as she finished in 3:03.40 for 941 points, though plenty of chances remain for her to seal a return to the London Aquatics Centre.<\/p>\n<h2>Dunn does double<\/h2>\n<p>Reece Dunn set a new S14 world record – subject to ratification &#8211; for the second time in a day as he won gold in the men’s multi-class (MC) 100m Freestyle.<\/p>\n<p>The Plymouth Leander swimmer claimed both World Series gold and British gold, touching the wall in 51.92s for a total of 1094 points.<\/p>\n<p>Dunn’s performance was made even more impressive by the fact it followed a gruelling 200m Individual Medley heat in the first session.<\/p>\n<p>He went on to claim silver in the World Series 200m IM final in a British-best time of 2:12.65 (919 points).<\/p>\n<h2><img class=\"alignnone size-full wp-image-7316\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web.jpg\" alt=\"\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Alice-Tai-web-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><br \/>\nTai on top of the world<\/h2>\n<p>Alice Tai had earlier set the pace for British athletes, winning World Series gold in the women’s MC 100m Freestyle.<\/p>\n<p>The S8 swimmer, of Ealing SC, clocked 1:04.06 to claim 981 points and continue her strong build-up to the World Championships.<\/p>\n<p>Tai is a gold medallist at Paralympic, world, European and Commonwealth level.<\/p>\n<p>“I’m pretty pleased with the time and the process of the race,” she said. “There are a few things I spoke to my coach about for the next time I swim, but I’m pretty happy with that.”<\/p>\n<h2>Challis smashes British record<\/h2>\n<p>Youngster Ellie Challis again smashed another longstanding British record, winning the World Series silver medal in the women’s MC 150m Individual Medley.<\/p>\n<p>The Colchester Phoenix swimmer was more than 20 seconds quicker than the previous best mark as she clocked 3:28.97 for a total of 578 points.<\/p>\n<p>Challis, the lowest classification swimmer in the country, broke a 26-year-old British record in the S4 50m Breaststroke at the National Para-Swimming Championships last December.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Maisie Summers-Newton set a new world record to win World Series gold in the 200m Individual Medley on the opening night of the British Para-Swimming International Meet in Glasgow. The Northampton swimmer broke her own previous SM6 world best, clocking 2:57.99 for a total of 1027 points, with the time subject to ratification. With this &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/brits-world-series-gold-glasgow\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":78,"featured_media":7318,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,27],"tags":[],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7315"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/78"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7315"}],"version-history":[{"count":4,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7315\/revisions"}],"predecessor-version":[{"id":7321,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7315\/revisions\/7321"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7318"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7315"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7315"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7315"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}},{"id":7302,"date":"2019-04-24T15:56:37","date_gmt":"2019-04-24T15:56:37","guid":{"rendered":"https:\/\/www.swimming.org\/sport\/?p=7302"},"modified":"2019-04-24T17:43:53","modified_gmt":"2019-04-24T17:43:53","slug":"british-para-swimming-international-meet","status":"publish","type":"post","link":"https:\/\/www.swimming.org\/sport\/british-para-swimming-international-meet\/","title":{"rendered":"British para-swimmers on world stage in Glasgow"},"content":{"rendered":"<p>All eyes will again be on the Tollcross International Swimming Centre in Glasgow this week, as the British Para-Swimming International Meet takes centre stage.<\/p>\n<p>The event features as the British leg of the World Para Swimming World Series, with the nation’s top athletes vying for a place on the Great Britain team for the 2019 World Para Swimming Championships, which will be held at the London Aquatics Centre in September.<\/p>\n<p>Five-time Paralympic champion and eight-time world champion <strong>Ellie Simmonds<\/strong> will be strongly backed to seal her place in the World Championships team.<\/p>\n<p>Simmonds won two golds as part of a four-medal haul at London 2012 and will headline the British charge in the 200m Individual Medley, 400m Freestyle and 100m Breaststroke.<\/p>\n<p>Defending World Series champion <strong>Louise Fiddes<\/strong> will be among those looking to impress when the action gets underway on Thursday 25 April.<\/p>\n<p>The Hatfield-based swimmer stunned the para-swimming world last year, beating three-time Paralympic champion Aurelie Rivard and Paralympic bronze medallist Chantalle Zijderveld to the coveted title.<\/p>\n<p>Fiddes, who holds the world record in the S14 200m Breaststroke, will compete in five events in Glasgow, including the 100m Breaststroke.<\/p>\n<p>Three-time Paralympic champion <strong>Oliver Hynd<\/strong>, of Mansfield, will compete in the 100m Freestyle, 400m Freestyle and 100m Backstroke.<\/p>\n<p>Hynd broke two world records on his way to gold in the 400m Freestyle S8 and 200m Individual Medley SM8 in Rio, but now competes in S9 events after being reclassified last year.<\/p>\n<p><strong>Michael Jones<\/strong> will look to continue his charge towards the Tokyo 2020 Paralympics as he features in the 100m Freestyle and 400m Freestyle.<\/p>\n<p>The National Performance Centre swimmer won Paralympic gold in the 400m Freestyle S7 in Rio, backing that up with gold at the 2018 European Championships in Dublin.<\/p>\n<h2>Stars of the future<\/h2>\n<p><img class=\"alignnone size-full wp-image-7304\" src=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web.jpg\" alt=\"\" srcset=\"https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web.jpg 1200w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-300x169.jpg 300w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-768x432.jpg 768w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-1024x576.jpg 1024w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-220x124.jpg 220w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-440x248.jpg 440w, https:\/\/d1s9j44aio5gjs.cloudfront.net\/2019\/04\/Ellie-Challis-web-660x371.jpg 660w\" sizes=\"(max-width: 1200px) 100vw, 1200px\" \/><br \/>\n42 athletes from the <a title=\"Swim England Para-Swimming Talent team\" href=\"https:\/\/www.swimming.org\/sport\/england-programmes-para-swimming\/\" target=\"_blank\" rel=\"noopener\">Swim England Para-Swimming Talent team<\/a> have qualified to compete in Glasgow, which equates to 87% of the entire programme’s swimmers.<\/p>\n<p><strong>Mwaba Mkwasa<\/strong> and <strong>Georgia Sheffield<\/strong> will make their debuts at the British Para-Swimming International Meet, adding to the depth of experience within the team.<\/p>\n<p>The event gives those in the talent team the opportunity to put into practice everything they have worked on with their coaches throughout the year.<\/p>\n<p>Swim England Para-Swimming Development Manager, Martin Lees, said: “Athletes have been developing daily and weekly competition plans, alongside process goals leading into the meet, to ensure they are well prepared and aware that timelines may be different at an international level meet, compared to those that they normally attend.<\/p>\n<p>“Great performances would be fantastic to see, but the main focus will be on gaining experience of competing alongside international athletes and seeing if they can execute their skills and processes under those conditions.”<\/p>\n<p>S14 competitor <strong>Reece Dunn<\/strong> will be competing in only his second para-swimming meet and his first at international level.<\/p>\n<p>Having broken the 100m Freestyle British record in December, the Plymouth swimmer will be eager to make an impression on the world stage.<\/p>\n<p>Colchester Phoenix swimmer <strong>Ellie Challis<\/strong> has her eye on Tokyo 2020 and has an opportunity to prove her progress.<\/p>\n<p>Challis, who is the lowest classification swimmer in the country, broke the 26-year-old British record in the 50m breaststroke at the National Para-Swimming Championships last December and will race across all four strokes.<\/p>\n<p>Meanwhile, visually-impaired twins <strong>Scarlett<\/strong> and<strong> Eliza Humphrey<\/strong> will compete against each other in six events, with Eliza also taking part in the 100m Butterfly.<\/p>\n<p>Visit the Swim England website for daily updates throughout the week.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>All eyes will again be on the Tollcross International Swimming Centre in Glasgow this week, as the British Para-Swimming International Meet takes centre stage. The event features as the British leg of the World Para Swimming World Series, with the nation’s top athletes vying for a place on the Great Britain team for the 2019 &hellip; <a href=\"https:\/\/www.swimming.org\/sport\/british-para-swimming-international-meet\/\"> [&hellip;]<\/a><\/p>\n","protected":false},"author":78,"featured_media":7312,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[1,27],"tags":[77],"_links":{"self":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7302"}],"collection":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/users\/78"}],"replies":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/comments?post=7302"}],"version-history":[{"count":7,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7302\/revisions"}],"predecessor-version":[{"id":7313,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/posts\/7302\/revisions\/7313"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media\/7312"}],"wp:attachment":[{"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/media?parent=7302"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/categories?post=7302"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.swimming.org\/sport\/wp-json\/wp\/v2\/tags?post=7302"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}]